Revit 2026 API

# RebarSpliceByRulesRunOutPosition Enumeration

---

Describes the run-out position.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarSpliceByRulesRunOutPosition
```
```vb
Public Enumeration RebarSpliceByRulesRunOutPosition
```
```cpp
public enum class RebarSpliceByRulesRunOutPosition
```
```fsharp
type RebarSpliceByRulesRunOutPosition
```

| Member name | Value | Description |
| --- | --- | --- |
| End | 1 | The rest will remain at the end of the bar. |
| Start | 0 | The rest will remain at the start of the bar. |

#### Reference

Autodesk.Revit.DB.Structure Namespace